In [1]:
import pandas as pd
import numpy as np

### Series Object

In [2]:
# A pandas Series is a one-dimensional array of inddexed data. It can be created from a list or array 
data = pd.Series([0.25, 0.50, .75, 1.00])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [3]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [4]:
data.shape

(4,)

In [5]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [7]:
# We can also defined index associated with the values
data1 = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
data1

a    1
b    2
c    3
d    4
dtype: int64

In [8]:
data1['b']

np.int64(2)

In [9]:
# Series as a specialised dictionary

population_dict = {
    'California': 123453,
    'Texas': 87561,
    'Boston': 908382,
    'New York': 907856
}

population = pd.Series(population_dict)
population

California    123453
Texas          87561
Boston        908382
New York      907856
dtype: int64

In [10]:
# By default, a Series will be created where the index is drawn from the sorted keys.
population['California']

np.int64(123453)

### Dataframe Object

Data frame is a generalized NumPy array
If a Series is an analog of a one-dimensional array with flexible indices, a DataFrame is an analog of a two-dimensional array with both 
flexible row indices and flexible column indices.

In [11]:
# DatFrame can be thought of either as a generalization of a NumPy array, or as a specialization of a python dictionary

area_dict = {
    'Texas': 695662,
    'Boston': 484000,
    'California': 423967, 
    'New Town': 23126
}

area = pd.Series(area_dict)
area

Texas         695662
Boston        484000
California    423967
New Town       23126
dtype: int64

In [12]:
states = pd.DataFrame(
    {
        'population': population, 
        'area': area
    }
)

states

            population      area
Boston        908382.0  484000.0
California    123453.0  423967.0
New Town           NaN   23126.0
New York      907856.0       NaN
Texas          87561.0  695662.0

In [13]:
states.index

Index(['Boston', 'California', 'New Town', 'New York', 'Texas'], dtype='object')

In [14]:
states.shape

(5, 2)

In [15]:
# DataFrame has a columns attribute, which is an index object holding the column labels
states.columns

Index(['population', 'area'], dtype='object')

In [16]:
states['area']

Boston        484000.0
California    423967.0
New Town       23126.0
New York           NaN
Texas         695662.0
Name: area, dtype: float64

#### DataFrame can we constructed with Several ways

In [17]:
# 1. Using Single Series object

pd.DataFrame(population, columns = ['Population'])

            Population
California      123453
Texas            87561
Boston          908382
New York        907856

In [18]:
# 2. From a list of dicts
data = [{'a': i, 'b': 2*i} for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [19]:
# 3. If some keys are missing pandas fill with them with NaN('Not a number')
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [20]:
# 4. From a dictionary of Series objects
pd.DataFrame({'population': population, 'area': area})

            population      area
Boston        908382.0  484000.0
California    123453.0  423967.0
New Town           NaN   23126.0
New York      907856.0       NaN
Texas          87561.0  695662.0

In [21]:
# 5. From a two-dimensional NumPy array
pd.DataFrame(np.random.rand(3, 2), columns=['Col-1', 'Col-2'], index=['a', 'b', 'c'])

      Col-1     Col-2
a  0.535025  0.096265
b  0.085501  0.526558
c  0.017890  0.734562

### Index Object

We have seen here that both the Series and DataFrame objects contain an explicit index that lets you reference and modify data. This Index object is an interesting structure in itself, and it can be thought of either as an immutable array or as an ordered set (technically a multiset, as Index objects may contain repeated values). Those views have some interesting consequences in the operations available on Index objects. As a simple example, let’s construct an Index from a list of integers

In [22]:
index = pd.Index([2, 3, 5, 7, 11])
index

Index([2, 3, 5, 7, 11], dtype='int64')

In [23]:
index[1]

np.int64(3)

In [24]:
index[::2]

Index([2, 5, 11], dtype='int64')

In [25]:
data = pd.Series([0.25,0.50,0.75,1],index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [26]:
'b' in data

True

In [27]:
data['b']

np.float64(0.5)

In [28]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [29]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [30]:
data['e'] = 1.25

In [31]:
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [32]:
data['a' : 'c'] # Slicing with explicit index, explicit means we're going to use actualt label or values of an index

a    0.25
b    0.50
c    0.75
dtype: float64

In [33]:
data[0:2] # slicing with implicit index, implicit means using numerical position or slicing

a    0.25
b    0.50
dtype: float64

In [34]:
data[(data > 0.3) & (data < 0.8)] # Masking

b    0.50
c    0.75
dtype: float64

### Indexes: loc, iloc and ix

In [35]:
data = pd.Series(['a', 'b', 'c'], index = [1,3,5])
data

1    a
3    b
5    c
dtype: object

In [36]:
# explicit index when indexing
data[1]

'a'

In [37]:
data[1:3]

3    b
5    c
dtype: object

In [38]:
# loc attribute allows indexing and slicing that always refresences the explicit index
data.loc[1]

'a'

In [39]:
data.loc[1:3]

1    a
3    b
dtype: object

In [40]:
# iloc allows indexing and slicing that always references the implicit Python-style index

data.iloc[1:3]

3    b
5    c
dtype: object

In [41]:
data.iloc[1]

'b'

In [42]:
pop_area = pd.DataFrame({'pop': population, 'area': area})
pop_area

                 pop      area
Boston      908382.0  484000.0
California  123453.0  423967.0
New Town         NaN   23126.0
New York    907856.0       NaN
Texas        87561.0  695662.0

In [43]:
pop_area['pop']

Boston        908382.0
California    123453.0
New Town           NaN
New York      907856.0
Texas          87561.0
Name: pop, dtype: float64

In [44]:
pop_area.area is pop_area['area']

True

In [45]:
pop_area.pop is pop_area['pop']

False

In [46]:
pop_area['density'] = pop_area['pop']/ pop_area['area']
pop_area

                 pop      area   density
Boston      908382.0  484000.0  1.876822
California  123453.0  423967.0  0.291185
New Town         NaN   23126.0       NaN
New York    907856.0       NaN       NaN
Texas        87561.0  695662.0  0.125867

In [47]:
pop_area.values

array([[9.08382000e+05, 4.84000000e+05, 1.87682231e+00],
       [1.23453000e+05, 4.23967000e+05, 2.91185399e-01],
       [           nan, 2.31260000e+04,            nan],
       [9.07856000e+05,            nan,            nan],
       [8.75610000e+04, 6.95662000e+05, 1.25867160e-01]])

In [48]:
# Transpose the full DataFrame to swap rows with columns
pop_area.T

                Boston     California  New Town  New York          Texas
pop      908382.000000  123453.000000       NaN  907856.0   87561.000000
area     484000.000000  423967.000000   23126.0       NaN  695662.000000
density       1.876822       0.291185       NaN       NaN       0.125867

In [49]:
pop_area.values[0]

array([9.08382000e+05, 4.84000000e+05, 1.87682231e+00])

In [50]:
pop_area.iloc[:3, :1] # Row, Column

                 pop
Boston      908382.0
California  123453.0
New Town         NaN

In [51]:
pop_area.loc[:'New York', :'area']

                 pop      area
Boston      908382.0  484000.0
California  123453.0  423967.0
New Town         NaN   23126.0
New York    907856.0       NaN

In [52]:
pop_area

                 pop      area   density
Boston      908382.0  484000.0  1.876822
California  123453.0  423967.0  0.291185
New Town         NaN   23126.0       NaN
New York    907856.0       NaN       NaN
Texas        87561.0  695662.0  0.125867

In [53]:
pop_area.loc[pop_area.density > 1.5, ['pop', 'area']]

             pop      area
Boston  908382.0  484000.0

In [54]:
pop_area[pop_area.density > 1.5]

             pop      area   density
Boston  908382.0  484000.0  1.876822

### Handling Missing Data

A number of schemes have been developed to indicate the presence of missing data in a table or DataFrame. Generally, they revolve around one of two strategies: using a mask that globally indicates missing values, or choosing a sentinel value that indicates a missing entry.

**In the masking approach**, the mask might be an entirely separate Boolean array, or it may involve appropriation of one bit in the data representation to locally indicate the null status of a value.

**In the sentinel approach**, the sentinel value could be some data-specific convention, such as indicating a missing integer value with –9999 or some rare bit pattern, or it could be a more global convention, such as indicating a missing floating-point value with NaN (Not a Number), a special value which is part of the IEEE floating-point specification

In [55]:
value1 = np.array([1, None, 2, 3])
value1

array([1, None, 2, 3], dtype=object)

In [56]:
value2 = np.array([1, np.nan, 2, 3])
value2

array([ 1., nan,  2.,  3.])

In [57]:
type(value2)

numpy.ndarray

In [58]:
value2.dtype

dtype('float64')

In [59]:
#  You should be aware that NaN is a bit like a data virus—it infects any other object it touches. Regardless of the operation, the result of arithmetic with NaN will be another NaN:

1+np.nan

nan

In [60]:
value2.sum(), value2.max(), value2.min()

(np.float64(nan), np.float64(nan), np.float64(nan))

In [61]:

data = pd.Series([1, np.nan, None, 4, 8, 'world'])
data

0        1
1      NaN
2     None
3        4
4        8
5    world
dtype: object

In [62]:
# Pandas have two useful methods for detecting null data: isnull() and notnull()
# isnull()::  Generate a Boolean mask indicating missing values
# notnull():: Oppsoite of isnull()
# dropna():: Return a filtered version of the data
# fillna():: Return a copy of the data with missing values filled or imputed

In [63]:
data.isnull()

0    False
1     True
2     True
3    False
4    False
5    False
dtype: bool

In [64]:
data.notnull()

0     True
1    False
2    False
3     True
4     True
5     True
dtype: bool

In [65]:
data[data.notnull()]

0        1
3        4
4        8
5    world
dtype: object

In [66]:
data.dropna()

0        1
3        4
4        8
5    world
dtype: object

In [67]:
df = pd.DataFrame(
    [
        [1, np.nan, 2],
        [2, 3, 5],
        [np.nan, 4, 6]
    ]
)
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [68]:
# Imp: We can not drop single values from a DatFrame, either we can drop complete row or complete column

df.dropna()

     0    1  2
1  2.0  3.0  5

In [69]:
df.dropna(axis=1) # OR df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [70]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [71]:
# The default is how='any', such that any row or column (depending on the axis key‐word) containing a null value will be dropped. 
#You can also specify how='all', which
# will only drop rows/columns that are all null values:

In [72]:
df.dropna(axis=1, how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [73]:
df.dropna(axis=1, how='any')

   2
0  2
1  5
2  6

In [74]:
df.fillna(0)

     0    1  2    3
0  1.0  0.0  2  0.0
1  2.0  3.0  5  0.0
2  0.0  4.0  6  0.0

In [75]:
df.ffill()

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  2.0  4.0  6 NaN

In [76]:
df.bfill()

     0    1  2   3
0  1.0  3.0  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

### Concat, merge and join operations

In [77]:
def create_df(cols, index):
    data = {c: [str(c) + str(i) for i in index] for c in cols}
    return pd.DataFrame(data, index)

In [78]:
print(create_df(list('abc'), range(10)))

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3
4  a4  b4  c4
5  a5  b5  c5
6  a6  b6  c6
7  a7  b7  c7
8  a8  b8  c8
9  a9  b9  c9

In [79]:
# pd.concat() can be used for a simple concatenation of Series or DataFrame objects

ser1 = pd.Series([1, 2, 3], index=['A', 'B', 'C'])
ser2 = pd.Series([4, 5, 6], index = ['D', 'E', 'F'])

pd.concat([ser1, ser2])

A    1
B    2
C    3
D    4
E    5
F    6
dtype: int64

In [80]:
df1 = create_df('AB', [1,2])
df2 = create_df('AB', [3,4])

print(df1); print(df2); print(pd.concat([df1, df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [81]:
df1 = create_df('AB', [1,2])
df2 = create_df('CD', [1,2])
print(pd.concat([df1, df2], axis=1))

    A   B   C   D
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [82]:
df5=create_df('ABC',[1,2])
df6=create_df('BCD',[3,4])

print(df5),print(df6),print(pd.concat([df5,df6]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

(None, None, None)

In [83]:
# Categories of Joins

# The pd.merge() function implements a number of types of joins: the one-to-one, many-to-one, and many-to-many joins. 
# All three types of joins are accessed via an
# identical call to the pd.merge() interface; the type of join performed depends on the form of the input data. 

# One-to-one joins

df1 = pd.DataFrame(
    {
        'employee': ['Bob', 'David', 'John', 'Adam'],
        'department': ['HR', 'Account', 'Sales', 'Account']
    }
)

df2 = pd.DataFrame(
    {
        'employee': ['David', 'Bob', 'Adam', 'John'],
        'hiring_date': [2021, 2019, 2023, 2020]
    }
)

df3 = df1.merge(df2)
df3

  employee department  hiring_date
0      Bob         HR         2019
1    David    Account         2021
2     John      Sales         2020
3     Adam    Account         2023

In [84]:
# Many to One Joins

df4=pd.DataFrame({'department':['Account','Sales','HR'],
                 'supervisor':['carly','Guido','steve']})

df5 = df3.merge(df4)
df5

  employee department  hiring_date supervisor
0      Bob         HR         2019      steve
1    David    Account         2021      carly
2     John      Sales         2020      Guido
3     Adam    Account         2023      carly

In [85]:
# US states population, area and population data
pop=pd.read_csv('./data/state-population.csv')
area=pd.read_csv('./data/state-areas.csv')
abbr=pd.read_csv('./data/state-abbrevs.csv')

In [86]:
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [87]:
area.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [88]:
abbr.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [89]:
# Many-to-one merge
# We’ll use how='outer' to make sure no data is thrown away due to mismatched labels
merge_pop_abbr = pd.merge(pop, abbr, left_on="state/region", right_on="abbreviation", how="outer")
merge_pop_abbr

     state/region     ages  year  population    state abbreviation
0              AK    total  1990    553290.0   Alaska           AK
1              AK  under18  1990    177502.0   Alaska           AK
2              AK    total  1992    588736.0   Alaska           AK
3              AK  under18  1991    182180.0   Alaska           AK
4              AK  under18  1992    184878.0   Alaska           AK
...           ...      ...   ...         ...      ...          ...
2539           WY  under18  1993    137458.0  Wyoming           WY
2540           WY    total  1991    459260.0  Wyoming           WY
2541           WY  under18  1991    136720.0  Wyoming           WY
2542           WY  under18  1990    136078.0  Wyoming           WY
2543           WY    total  1990    453690.0  Wyoming           WY

[2544 rows x 6 columns]

In [90]:
# Will drop duplicate column
merge_pop_abbr = merge_pop_abbr.drop(columns="abbreviation")
merge_pop_abbr.head()

  state/region     ages  year  population   state
0           AK    total  1990    553290.0  Alaska
1           AK  under18  1990    177502.0  Alaska
2           AK    total  1992    588736.0  Alaska
3           AK  under18  1991    182180.0  Alaska
4           AK  under18  1992    184878.0  Alaska

In [91]:
# double-check whether there were any mismatches here, which we can do by looking for rows with nulls
merge_pop_abbr.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [92]:
# Some of the population info is null; let’s figure out which these are!
merge_pop_abbr[merge_pop_abbr["population"].isnull()].head()

     state/region     ages  year  population state
1872           PR  under18  1990         NaN   NaN
1873           PR    total  1990         NaN   NaN
1874           PR    total  1991         NaN   NaN
1875           PR  under18  1991         NaN   NaN
1876           PR    total  1993         NaN   NaN

In [93]:
merge_pop_abbr[merge_pop_abbr["state"].isnull()].head(10)

     state/region     ages  year  population state
1872           PR  under18  1990         NaN   NaN
1873           PR    total  1990         NaN   NaN
1874           PR    total  1991         NaN   NaN
1875           PR  under18  1991         NaN   NaN
1876           PR    total  1993         NaN   NaN
1877           PR  under18  1993         NaN   NaN
1878           PR  under18  1992         NaN   NaN
1879           PR    total  1992         NaN   NaN
1880           PR  under18  1994         NaN   NaN
1881           PR    total  1994         NaN   NaN

In [94]:
merge_pop_abbr.loc[merge_pop_abbr["state"].isnull(), "state/region"].unique()

array(['PR', 'USA'], dtype=object)

In [95]:
merge_pop_abbr.loc[merge_pop_abbr['state/region'] == 'PR', 'state'] = 'Purto Rico'

In [96]:
merge_pop_abbr.loc[merge_pop_abbr['state/region'] == 'USA', 'state'] = 'United States'

In [97]:
merge_pop_abbr.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [98]:
# Merge Area data using state column

area.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [99]:
final = pd.merge(merge_pop_abbr, area, how='left', on='state')
final.head()

  state/region     ages  year  population   state  area (sq. mi)
0           AK    total  1990    553290.0  Alaska       656425.0
1           AK  under18  1990    177502.0  Alaska       656425.0
2           AK    total  1992    588736.0  Alaska       656425.0
3           AK  under18  1991    182180.0  Alaska       656425.0
4           AK  under18  1992    184878.0  Alaska       656425.0

In [100]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [101]:
final.loc[final['population'].isnull()].head()

     state/region     ages  year  population       state  area (sq. mi)
1872           PR  under18  1990         NaN  Purto Rico            NaN
1873           PR    total  1990         NaN  Purto Rico            NaN
1874           PR    total  1991         NaN  Purto Rico            NaN
1875           PR  under18  1991         NaN  Purto Rico            NaN
1876           PR    total  1993         NaN  Purto Rico            NaN

In [102]:
# There are nulls in the area column; we can take a look to see which regions were ignored here
final['state'][final['area (sq. mi)'].isnull()].unique()

array(['Purto Rico', 'United States'], dtype=object)

In [103]:
final.dropna(inplace=True)
final.head()

  state/region     ages  year  population   state  area (sq. mi)
0           AK    total  1990    553290.0  Alaska       656425.0
1           AK  under18  1990    177502.0  Alaska       656425.0
2           AK    total  1992    588736.0  Alaska       656425.0
3           AK  under18  1991    182180.0  Alaska       656425.0
4           AK  under18  1992    184878.0  Alaska       656425.0

In [104]:
# Write query like sql

data_2010 = final.query("ages=='total' & year==2010")
data_2010.head()

    state/region   ages  year  population       state  area (sq. mi)
43            AK  total  2010    713868.0      Alaska       656425.0
51            AL  total  2010   4785570.0     Alabama        52423.0
141           AR  total  2010   2922280.0    Arkansas        53182.0
149           AZ  total  2010   6408790.0     Arizona       114006.0
197           CA  total  2010  37333601.0  California       163707.0

In [105]:
data_2010.set_index('state', inplace=True)
density = data_2010['population']/ data_2010['area (sq. mi)']

In [106]:
density.sort_values(ascending=False, inplace=True)
density.head()

state
District of Columbia    8898.897059
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
Massachusetts            621.815538
dtype: float64

### GroupBy

In [107]:
df = pd.DataFrame({
    'data': [1,2,3,4,5,6,7],
    'key': ['A', 'B', 'C', 'D', 'E', 'F', 'G']
})
df

   data key
0     1   A
1     2   B
2     3   C
3     4   D
4     5   E
5     6   F
6     7   G

In [108]:
df.groupby('key')

In [109]:
df.groupby('key').sum()

     data
key
A       1
B       2
C       3
D       4
E       5
F       6
G       7

In [110]:
import seaborn as sns
planets=sns.load_dataset('planets')
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [111]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [112]:
planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [113]:
planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.0
       Eclipse Timing Variations           9.0
       Imaging                            38.0
       Microlensing                       23.0
       Orbital Brightness Modulation       3.0
                                         ...
max    Pulsar Timing                    2011.0
       Pulsation Timing Variations      2007.0
       Radial Velocity                  2014.0
       Transit                          2014.0
       Transit Timing Variations        2014.0
Length: 80, dtype: float64

In [114]:
rng=np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],'data1': range(6),'data2': rng.randint(0, 10, 6)},columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [115]:
df.groupby('key').sum()

     data1  data2
key
A        3      8
B        5      7
C        7     12

In [116]:
df.groupby('key').aggregate(["min", "median", "max"])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [117]:
df.groupby(df['key']).sum()

     data1  data2
key
A        3      8
B        5      7
C        7     12

In [118]:
df2 = df.set_index('key')
mapping = {'A': 'consonent', 'B': 'vowel', 'C': 'consonent'}
df2

     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9

In [119]:
print(df2.groupby(mapping).sum())

           data1  data2
key
consonent     10     20
vowel          5      7

### Pivot Table
The pivot table takes simple columnwise data as input, and groups the entries into a two-dimensional table that provides a multidimensional summarization of the data.

In [120]:
titanic=sns.load_dataset('titanic')
print(titanic.head(20))

    survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0          0       3    male  22.0      1      0   7.2500        S   Third
1          1       1  female  38.0      1      0  71.2833        C   First
2          1       3  female  26.0      0      0   7.9250        S   Third
3          1       1  female  35.0      1      0  53.1000        S   First
4          0       3    male  35.0      0      0   8.0500        S   Third
5          0       3    male   NaN      0      0   8.4583        Q   Third
6          0       1    male  54.0      0      0  51.8625        S   First
7          0       3    male   2.0      3      1  21.0750        S   Third
8          1       3  female  27.0      0      2  11.1333        S   Third
9          1       2  female  14.0      1      0  30.0708        C  Second
10         1       3  female   4.0      1      1  16.7000        S   Third
11         1       1  female  58.0      0      0  26.5500        S   First
12         0       3    male  20.0      0      0   8.0500        S   Third
13         0       3    male  39.0      1      5  31.2750        S   Third
14         0       3  female  14.0      0      0   7.8542        S   Third
15         1       2  female  55.0      0      0  16.0000        S  Second
16         0       3    male   2.0      4      1  29.1250        Q   Third
17         1       2    male   NaN      0      0  13.0000        S  Second
18         0       3  female  31.0      1      0  18.0000        S   Third
19         1       3  female   NaN      0      0   7.2250        C   Third

      who  adult_male deck  embark_town alive  alone
0     man        True  NaN  Southampton    no  False
1   woman       False    C    Cherbourg   yes  False
2   woman       False  NaN  Southampton   yes   True
3   woman       False    C  Southampton   yes  False
4     man        True  NaN  Southampton    no   True
5     man        True  NaN   Queenstown    no   True
6     man        True    E  Southampton    no   True
7   child       False  NaN  Southampton    no  False
8   woman       False  NaN  Southampton   yes  False
9   child       False  NaN    Cherbourg   yes  False
10  child       False    G  Southampton   yes  False
11  woman       False    C  Southampton   yes   True
12    man        True  NaN  Southampton    no   True
13    man        True  NaN  Southampton    no  False
14  child       False  NaN  Southampton    no   True
15  woman       False  NaN  Southampton   yes   True
16  child       False  NaN   Queenstown    no  False
17    man        True  NaN  Southampton   yes   True
18  woman       False  NaN  Southampton    no  False
19  woman       False  NaN    Cherbourg   yes   True

In [121]:
# take a look at survivor with gender
titanic.groupby('sex')['survived'].sum()

sex
female    233
male      109
Name: survived, dtype: int64

In [122]:
# Surviveral rate
titanic.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [123]:
titanic.groupby(['sex', 'class'], observed=False)['survived'].aggregate("mean").unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [124]:
# Here is the equivalent to the preceding operation using the pivot_table method of DataFrames
titanic.pivot_table(values='survived', index='sex', columns='class', aggfunc='mean', observed=False)

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [125]:
titanic.pivot_table(columns='class', index='sex', aggfunc={'survived': 'sum', 'fare':'mean'}, observed=False)

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

In [126]:
# At times it’s useful to compute totals along each grouping. This can be done via the margins keyword

titanic.pivot_table('survived', index='sex', columns='class', margins=True)

/var/folders/6l/9g6t4kp90gn4973plz_3k_c00000gn/T/ipykernel_22229/913893530.py:3: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  titanic.pivot_table('survived', index='sex', columns='class', margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

In [132]:
d = {"genre": ["A", "A", "A", "A", "A", "B", "B", "C", "D", "E", "F"]}
df = pd.DataFrame(d)

df

# Count frequency
frequency = df['genre'].value_counts(normalize=True)
frequency

genre
A    0.454545
B    0.181818
C    0.090909
D    0.090909
E    0.090909
F    0.090909
Name: proportion, dtype: float64

In [135]:
# guess some threshold number and filter smaller frequency

threshold = 0.15
small_frequencies = frequency[frequency < threshold].index
small_frequencies

Index(['C', 'D', 'E', 'F'], dtype='object', name='genre')

In [136]:
df['genre'] = df['genre'].replace(small_frequencies, "Other")
df['genre'].value_counts(normalize=True)

genre
A        0.454545
Other    0.363636
B        0.181818
Name: proportion, dtype: float64

In [138]:
drink_data = pd.read_csv("./data/drinksbycountry.csv")
drink_data.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [140]:
col_types = drink_data.dtypes.to_frame()
col_types.rename({0: "type"}, inplace=True, axis=1)
col_types

                                 type
country                        object
beer_servings                   int64
spirit_servings                 int64
wine_servings                   int64
total_litres_of_pure_alcohol  float64
continent                      object

In [141]:
col_types.to_csv("./data/changetype.csv")

In [144]:
# Again import created csv and convert it to a dictionary
col_dict = pd.read_csv("./data/changetype.csv", index_col=0)["type"].to_dict()
col_dict

{'country': 'object',
 'beer_servings': 'int64',
 'spirit_servings': 'int64',
 'wine_servings': 'int64',
 'total_litres_of_pure_alcohol': 'float64',
 'continent': 'object'}

In [145]:
col_dict["country"] = "category"
col_dict["continent"] = "category"

col_dict

{'country': 'category',
 'beer_servings': 'int64',
 'spirit_servings': 'int64',
 'wine_servings': 'int64',
 'total_litres_of_pure_alcohol': 'float64',
 'continent': 'category'}

In [148]:
drink_data = pd.read_csv("./data/drinksbycountry.csv", dtype=col_dict)
drink_data.dtypes

country                         category
beer_servings                      int64
spirit_servings                    int64
wine_servings                      int64
total_litres_of_pure_alcohol     float64
continent                       category
dtype: object

In [155]:
drink_data = pd.read_csv("./data/drinksbycountry.csv", index_col="country")
drink_data.iloc[10:20, :].loc[:, "beer_servings": "wine_servings"]

            beer_servings  spirit_servings  wine_servings
country
Azerbaijan             21               46              5
Bahamas               122              176             51
Bahrain                42               63              7
Bangladesh              0                0              0
Barbados              143              173             36
Belarus               142              373             42
Belgium               295               84            212
Belize                263              114              8
Benin                  34                4             13
Bhutan                 23                0              0

In [156]:
d = {"customer":["A", "B", "C", "D", "E"], "sales":[100, "100", 50, 550.20, "375.25"]}
df = pd.DataFrame(d)
df

  customer   sales
0        A     100
1        B     100
2        C      50
3        D   550.2
4        E  375.25

In [157]:
df.dtypes

customer    object
sales       object
dtype: object

In [160]:
# df["sales"].sum() TypeError: unsupported operand type(s) for +: 'int' and 'str'
df["sales"].apply(type) # we can see all data types 
df["sales"].apply(type).value_counts()

sales
<class 'int'>      2
<class 'str'>      2
<class 'float'>    1
Name: count, dtype: int64

In [161]:
df["sales"] = df["sales"].astype(float)
df["sales"].sum()

np.float64(1175.45)

In [162]:
df["sales"].apply(type).value_counts()

sales
<class 'float'>    5
Name: count, dtype: int64